import Breadcrumb from "@/components/modules/breadcrumb/Breadcrumb";
import Footer from "@/components/modules/footer/Footer";
import Navbar from "@/components/modules/navbar/Navbar";
import styles from "@/styles/aboutUs.module.css";
import { authUser } from "@/utils/authUser";

const page = async () => {
  const user = await authUser();

  return (
    <>
      <Navbar isLogin={user} />
      <Breadcrumb route={"درباره ما"} />
      <div className={styles.container}>
        <section>
          <div>
            <span>درباره ما</span>
            <p>عطر خوش رایحه ی خوش</p>
          </div>
          <p>
            تجربه‌ای به قدمت دو نسل و ارتباط مستمر با مصرف کنندگان ضامن این
            ویژگی‌هاست. از ویژگی‌های بارز مجموعه رایحه ی خوش واردات مواد اولیه
            به وسیله مدیریت مجموعه و انتخاب بهترین مواد اولیه جهت تولید ادکلن و اسپری
            است.
          </p>
          <p>
            مجموعه  رایحه ی خوش یکی از بهترین مجموعه های مرتبط با ادکلن در ایران است که از سال 2014
            شروع به صادر کردن ادکلن و اسپری به اروپا کرده است
          </p>
        </section>
        <main className={styles.main}>
          <div>
            <p>
              ما در <strong>رایحه‌ی خوش</strong> بر این باوریم که عطر تنها یک بو نیست،
              بلکه احساسی است که در ذهن و قلب ماندگار می‌شود.
              به همین دلیل، مجموعه‌ای از اصیل‌ترین عطرها از برندهای معتبر جهانی را گردآوری کرده‌ایم
              تا تجربه‌ای خاص و لوکس از خرید آنلاین برای شما فراهم کنیم.
            </p>
            <p>
              تمامی محصولات ما با ضمانت اصالت کالا و ارسال سریع ارائه می‌شوند تا با خیالی آسوده،
              رایحه‌ی مورد علاقه‌تان را انتخاب و در هر لحظه از روز، حس خوب زندگی را تجربه کنید.
            </p>
            <p>
              امید داریم با کسب دانش روز دنیا در این صنعت ارتقا کیفیت و تنوع
              محصول در حد استانداردهای جهانی را در آینده‌ای نزدیک شاهد باشیم.
            </p>
            <p>صاحب امتیاز: شرکت رایحه‌ی خوش</p>
          </div>
          <div>
            <span>Rayehaye Khosh</span>
            <p className={styles.title}>داستان رایحه‌ی خوش</p>
            <p>
              تجربه‌ای به قدمت دو نسل و ارتباط مستمر با مصرف کنندگان ضامن این
              ویژگی‌هاست. از ویژگی‌های بارز مجموعه رایحه‌ی خوش واردات مواد اولیه
               به وسیله مدیریت مجموعه و انتخاب بهترین مواد اولیه جهت تولید
              ادکلن و اسپری است.
            </p>
            <p>
              ما اکنون با پشتوانه دستاوردهای گذشته و
              تکنولوژی روز دنیا وارد مرحله تولید عطر و ادکلن  به صورت صنعتی و گسترده
              شده‌ایم و مفتخریم اعلام کنیم که «رایحه ی خوش» از این پس یک نام تجاری
              صنعتی در صنعت عطر و ادکلن ایران است
            </p>
          </div>
        </main>
      </div>

      <Footer />
    </>
  );
};

export default page;